In [3]:
import pandas as pd;
import pandera as pa;
import numpy as np;
from nptyping import NDArray, Shape, Int64;

In [9]:
total : int = 10000;

s1 : NDArray[Shape[str(total)], Int64] = np.random.randint(80, 100, total);

print(len(s1));

s1

10000

array([93, 98, 96, ..., 83, 89, 89])

In [19]:
total : int = 10000;

s1 : NDArray[Shape[str(total)], Int64] = np.random.randint(80, 100, total);

ss1: pd.Series = pd.Series(s1);

display(s1);

print(len(ss1));

ss1

array([81, 95, 84, ..., 82, 87, 81])

10000

0       81
1       95
2       84
3       90
4       80
        ..
9995    94
9996    98
9997    82
9998    87
9999    81
Length: 10000, dtype: int32

In [48]:
total : int = 10000;

s1 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(80, 100, (total, 5));

ss1: pd.DataFrame = pd.DataFrame(s1, columns=["s1","s2","s3","s4","s5"]);

s2 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(70, 79, (total, 5));

ss2: pd.DataFrame = pd.DataFrame(s2, columns=["s1","s2","s3","s4","s5"]);

s3 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(60, 69, (total, 5));

ss3: pd.DataFrame = pd.DataFrame(s3, columns=["s1","s2","s3","s4","s5"]);

s4 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(50, 59, (total, 5));

ss4: pd.DataFrame = pd.DataFrame(s4, columns=["s1","s2","s3","s4","s5"]);

s5 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(40, 49, (total, 5));

ss5: pd.DataFrame = pd.DataFrame(s5, columns=["s1","s2","s3","s4","s5"]);

s6 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(33, 39, (total, 5));

ss6: pd.DataFrame = pd.DataFrame(s6, columns=["s1","s2","s3","s4","s5"]);

s7 : NDArray[Shape[str(total)+"5"], Int64] = np.random.randint(0, 32, (total, 5));

ss7: pd.DataFrame = pd.DataFrame(s7, columns=["s1","s2","s3","s4","s5"]);

print(len(ss1));

print(len(ss2));

print(len(ss3));

print(len(ss4));

print(len(ss5));

print(len(ss6));

print(len(ss7));

10000
10000
10000
10000
10000
10000
10000

In [49]:
ss1

      s1  s2  s3  s4  s5
0     87  86  95  89  98
1     85  88  80  91  95
2     80  83  90  90  80
3     85  98  86  91  93
4     99  95  92  91  83
...   ..  ..  ..  ..  ..
9995  90  89  97  83  94
9996  88  97  83  89  97
9997  91  97  88  84  81
9998  95  94  97  98  84
9999  80  84  80  90  88

[10000 rows x 5 columns]

In [50]:
ss4

      s1  s2  s3  s4  s5
0     57  54  53  57  50
1     52  51  55  58  57
2     57  53  57  51  52
3     50  54  51  52  57
4     57  58  53  56  58
...   ..  ..  ..  ..  ..
9995  55  58  56  51  51
9996  56  53  52  50  54
9997  55  57  54  54  51
9998  53  58  54  50  58
9999  55  50  54  57  54

[10000 rows x 5 columns]

In [51]:
ss6

      s1  s2  s3  s4  s5
0     34  36  38  35  33
1     38  35  38  35  36
2     34  37  37  35  37
3     35  37  37  35  33
4     37  35  34  34  36
...   ..  ..  ..  ..  ..
9995  36  37  35  38  37
9996  36  34  36  35  35
9997  36  34  38  33  34
9998  38  38  34  36  38
9999  37  33  36  33  34

[10000 rows x 5 columns]

In [59]:
df : pd.DataFrame = pd.concat([ss1,ss2,ss3,ss4,ss5,ss6,ss7]).reset_index(drop=True);

display(df.info());

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70000 entries, 0 to 69999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   s1      70000 non-null  int32
 1   s2      70000 non-null  int32
 2   s3      70000 non-null  int32
 3   s4      70000 non-null  int32
 4   s5      70000 non-null  int32
dtypes: int32(5)
memory usage: 1.3 MB

None

In [60]:
display(df.describe());

                 s1            s2            s3            s4            s5
count  70000.000000  70000.000000  70000.000000  70000.000000  70000.000000
mean      53.795929     53.813214     53.775029     53.789714     53.755386
std       23.383288     23.378185     23.370605     23.386442     23.415591
min        0.000000      0.000000      0.000000      0.000000      0.000000
25%       37.000000     37.000000     37.000000     37.000000     37.000000
50%       54.000000     54.000000     54.000000     54.000000     54.000000
75%       72.000000     72.000000     72.000000     72.000000     72.000000
max       99.000000     99.000000     99.000000     99.000000     99.000000

In [61]:
display(df.head());

   s1  s2  s3  s4  s5
0  87  86  95  89  98
1  85  88  80  91  95
2  80  83  90  90  80
3  85  98  86  91  93
4  99  95  92  91  83

In [62]:
display(df.tail());

       s1  s2  s3  s4  s5
69995   2   3   1  18  19
69996  12  11   3  24   2
69997  28  11   2   0  19
69998  25  18  29   3   8
69999  15   1  12  23  21

In [56]:
df.to_csv("data.csv", index=False) # Create CSV File And Add Previous Function Data

In [63]:
df1 : pd.DataFrame = pd.read_csv("./data.csv");

df1.head()

   s1  s2  s3  s4  s5
0  87  86  95  89  98
1  85  88  80  91  95
2  80  83  90  90  80
3  85  98  86  91  93
4  99  95  92  91  83